OdDbHostAppProgressMeter.setLimit(System.Int32)
\details
Notification function called to specify the maximum number of times this
ProgressMeter object will be incremented.
\param max [in]  Maximum meterProgress calls.

OdDbHostAppProgressMeter.meterProgress
\details
Notification function called to increment this ProgressMeter object.
\remarks
The completion percentage may be calculated by dividing the number of times
this function is called by the value set by setLimit.
\remarks
Throwing an exception indicates that the operation associated with this ProgressMeter object
should be halted.

OdDbHostAppProgressMeter.stop
\details
Notification function called to terminate this ProgressMeter object.

OdDbHostAppProgressMeter.start(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Notification function called to initialize this ProgressMeter object.
\param displayString [in]  String to be displayed.

OdDbHostAppProgressMeter.Dispose
\details
Virtual destructor.